LoadTesting/art.yml
config:
  target: http://localhost:3001
  phases:
    - duration: 10
      arrivalRate: 1000
  # defaults:
  #   headers:
  payload:
    path: "numbers.csv"
    fields: 
      - "id"
    order: sequence
    skipHeader: true
scenarios:
  - name: "testing id endpoint"
    flow:
      - get:
          url: "/products/{{ id }}"